### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.web_apps.azurerm_role_assignment.key_vault_fims_rp_example_app_secrets_user must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_fims_rp_example_app_secrets_user" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/8e1bb00c-17eb-a780-a870-52cc5c5d537c" -> (known after apply)
      ~ name                                   = "8e1bb00c-17eb-a780-a870-52cc5c5d537c" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-fims-kv-01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.key_vault_op_app["Key Vault Crypto User"] must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_op_app" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/57b5d16c-6f51-6156-00f6-e51bba1aa3ab" -> (known after apply)
      ~ name                                   = "57b5d16c-6f51-6156-00f6-e51bba1aa3ab" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/12338af0-0e69-4776-bea7-57ae8d297424" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-fims-kv-01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.key_vault_op_app["Key Vault Secrets User"] must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_op_app" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/cc1d15a2-de17-aa96-f826-395efc23ea15" -> (known after apply)
      ~ name                                   = "cc1d15a2-de17-aa96-f826-395efc23ea15" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-fims-kv-01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.key_vault_op_app_slot["Key Vault Crypto User"] must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_op_app_slot" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/92cf7394-0245-fc64-f5cf-0d278b41f081" -> (known after apply)
      ~ name                                   = "92cf7394-0245-fc64-f5cf-0d278b41f081" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/12338af0-0e69-4776-bea7-57ae8d297424" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-fims-kv-01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.key_vault_op_app_slot["Key Vault Secrets User"] must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_op_app_slot" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/77800bb9-b249-3808-44bb-ed1b91a7516d" -> (known after apply)
      ~ name                                   = "77800bb9-b249-3808-44bb-ed1b91a7516d" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-fims-kv-01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.key_vault_user_func must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_user_func" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/6c56cbce-613e-cd10-7d5f-7b1178480b15" -> (known after apply)
      ~ name                                   = "6c56cbce-613e-cd10-7d5f-7b1178480b15" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-fims-kv-01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.web_apps.module.rp_example.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-fims-rg-01/providers/Microsoft.Web/sites/io-p-weu-fims-rp-example-app-02"
        name                                           = "io-p-weu-fims-rp-example-app-02"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_app.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-app-01"
        name                                           = "io-p-itn-fims-op-app-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_app.azurerm_linux_web_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-app-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.user_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-user-func-01"
        name                                           = "io-p-itn-fims-user-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 4 to change, 6 to destroy.
```

</details>
